{
  "policy": {
    "name": "aws_kms_policy",
    "short_description": "AWS KMS Policy",
    "description": null,
    "settings": {
      "tests": {
        "output_format": null
      }
    },
    "operating_system_family_id": null,
    "operating_system_id": null,
    "type": null
  },
  "data": [
    {
      "Managed Keys": [
        {
          "Managed Keys": [
            {
              "id": "Managed-KeysManaged-Keys3-8-Ensure-rotation-for-customer-created-CMKs-is-enabled",
              "KMS": {
                "name": "2ee7baf8-9cc2-4378-aec7-9d38fe24eab8"
              },
              "name": "3.8 Ensure rotation for customer created CMKs is enabled",
              "checks": {
                "key rotation enabled": [
                  {
                    "exp": "true",
                    "check": "equals",
                    "expected": "true",
                    "background": "AWS Key Management Service (KMS) allows customers to rotate the backing key which is key material stored within the KMS which is tied to the key ID of the Customer Created customer master key (CMK). It is the backing key that is used to perform cryptographic operations such as encryption and decryption. Automated key rotation currently retains all prior backing keys so that decryption of encrypted data can take place transparently. It is recommended that CMK key rotation be enabled.\nRotating encryption keys helps reduce the potential impact of a compromised key as data encrypted with a new key cannot be accessed with a previous key that may have been exposed.",
                    "remediation": "From Console:\n1. Sign in to the AWS Management Console and open the IAM console at https://console.aws.amazon.com/iam.\n2. In the left navigation pane, choose Encryption Keys .\n3. Select a customer created master key (CMK)\n4. Under the Key Policy section, move down to Key Rotation .\n5. Check the Rotate this key every year checkbox.\nFrom Command Line:\n1. Run the following command to enable key rotation:\naws kms enable-key-rotation --key-id 'kms_key_id'"
                  }
                ]
              },
              "ci_path": [
                "Managed Keys",
                "Managed Keys",
                "*"
              ],
              "check_type": "kms",
              "description": "3.8 Ensure rotation for customer created CMKs is enabled",
              "nodeGroupsOpen": true
            }
          ]
        }
      ]
    }
  ],
  "scan_options": {}
}
